RapidAI/MaClaw/iot-agentos/sdkconfig.defaults
# All release profiles in this project target the ESP32-S3.  In a clean CI
# build ESP-IDF otherwise falls back to its generic ESP32 target before the
# board-specific defaults are applied, which prevents S3-only components
# (such as the Fangtang NV3023 display driver) from being resolved.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
# ESP32-S3 Wi-Fi-only builds do not need the coexistence component.  Leaving
# its implicit default enabled triggers an ESP-IDF 6.0.2 timer-ISR race after
# AP association on EchoEar, causing a reset loop.
CONFIG_ESP_COEX_ENABLED=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# The ESP32-S3 Bread Compact intermittently faults in the hardware-MPI
# interrupt path while verifying the Hub's ECDSA certificate chain.  The
# failure is a Cache/MMU exception during the first TLS handshake, which traps
# the device in a boot loop.  Keep the crypto peripheral available for normal
# operations, but perform MPI/AES work synchronously until the IDF driver path
# is validated on this board revision.  This affects only handshake latency,
# not TLS verification or transport security.
CONFIG_MBEDTLS_MPI_USE_INTERRUPT=n
CONFIG_MBEDTLS_AES_USE_INTERRUPT=n
CONFIG_ESP_TLS_USE_DS_PERIPHERAL=n
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# The firmware identity task serves nonce-bound IDENTIFY and BOOT_STATUS
# queries through this secondary endpoint. Keep it on for every release
# profile so the desktop flasher can prove post-write boot without relying on
# unbound log broadcasts.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_MN_CN_MULTINET7_QUANT=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# Keep several independent time sources. Some networks intermittently block
# or fail to resolve an individual public NTP endpoint.
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# A cached 256x256 RGB565+A8 pet frame is 192 KiB. SPIFFS reclaims one 4 KiB
# block per GC run, so the default limit of 10 cannot replace even one frame
# after a pet switch. Keep this bounded above the 48-run per-frame minimum.
CONFIG_SPIFFS_GC_MAX_RUNS=64

# The client only links the MP3 frame decoder. Disable unrelated audio-codec
# implementations so they cannot consume application flash as features grow.
CONFIG_AUDIO_DECODER_AAC_SUPPORT=n
CONFIG_AUDIO_DECODER_MP3_SUPPORT=y
CONFIG_AUDIO_DECODER_G711_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_DECODER_FLAC_SUPPORT=n
CONFIG_AUDIO_DECODER_OPUS_SUPPORT=n
CONFIG_AUDIO_DECODER_VORBIS_SUPPORT=n
CONFIG_AUDIO_DECODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_DECODER_ALAC_SUPPORT=n
CONFIG_AUDIO_DECODER_PCM_SUPPORT=n
CONFIG_AUDIO_DECODER_SBC_SUPPORT=n
CONFIG_AUDIO_DECODER_LC3_SUPPORT=n
CONFIG_AUDIO_DECODER_G722_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_WAV_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_M4A_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_TS_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_OGG_SUPPORT=n
CONFIG_AUDIO_ENCODER_AAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_G711_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_ENCODER_OPUS_SUPPORT=n
CONFIG_AUDIO_ENCODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_ALAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_PCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_SBC_SUPPORT=n
CONFIG_AUDIO_ENCODER_LC3_SUPPORT=n
CONFIG_AUDIO_ENCODER_G722_SUPPORT=n
# Public Hub TLS setup can legitimately occupy CPU1 for slightly over five
# seconds on this S3. Keep the watchdog enabled on both idle tasks, but give a
# bounded 10-second window so a successful certificate handshake does not emit
# a false watchdog alarm during normal boot/pairing.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
# Power management (optional): CONFIG_MACLAW_POWER_SAVE in menuconfig only
# switches the firmware code paths (esp_pm_configure + PM locks). To actually
# enable DFS 80-240 MHz and tickless idle, also set CONFIG_PM_ENABLE=y and
# CONFIG_FREERTOS_USE_TICKLESS_IDLE=y here or via idf.py menuconfig. They are
# left unset so the default build behaviour is unchanged, and the combination
# still needs on-device validation of audio/LCD timing.
